GopalSaraf/Practicals/PSDL/include/proc/pic16f1579.inc
#define PWM1PRL3                         BANKMASK(PWM1PRL), 3
#define PWM1PRL4                         BANKMASK(PWM1PRL), 4
#define PWM1PRL5                         BANKMASK(PWM1PRL), 5
#define PWM1PRL6                         BANKMASK(PWM1PRL), 6
#define PWM1PRL7                         BANKMASK(PWM1PRL), 7
#define PWM1PS0                          BANKMASK(PWM1CLKCON), 4
#define PWM1PS1                          BANKMASK(PWM1CLKCON), 5
#define PWM1PS2                          BANKMASK(PWM1CLKCON), 6
#define PWM1TMRH0                        BANKMASK(PWM1TMRH), 0
#define PWM1TMRH1                        BANKMASK(PWM1TMRH), 1
#define PWM1TMRH2                        BANKMASK(PWM1TMRH), 2
#define PWM1TMRH3                        BANKMASK(PWM1TMRH), 3
#define PWM1TMRH4                        BANKMASK(PWM1TMRH), 4
#define PWM1TMRH5                        BANKMASK(PWM1TMRH), 5
#define PWM1TMRH6                        BANKMASK(PWM1TMRH), 6
#define PWM1TMRH7                        BANKMASK(PWM1TMRH), 7
#define PWM1TMRL0                        BANKMASK(PWM1TMRL), 0
#define PWM1TMRL1                        BANKMASK(PWM1TMRL), 1
#define PWM1TMRL2                        BANKMASK(PWM1TMRL), 2
#define PWM1TMRL3                        BANKMASK(PWM1TMRL), 3
#define PWM1TMRL4                        BANKMASK(PWM1TMRL), 4
#define PWM1TMRL5                        BANKMASK(PWM1TMRL), 5
#define PWM1TMRL6                        BANKMASK(PWM1TMRL), 6
#define PWM1TMRL7                        BANKMASK(PWM1TMRL), 7
#define PWM2CS0                          BANKMASK(PWM2CLKCON), 0
#define PWM2CS1                          BANKMASK(PWM2CLKCON), 1
#define PWM2DCH0                         BANKMASK(PWM2DCH), 0
#define PWM2DCH1                         BANKMASK(PWM2DCH), 1
#define PWM2DCH2                         BANKMASK(PWM2DCH), 2
#define PWM2DCH3                         BANKMASK(PWM2DCH), 3
#define PWM2DCH4                         BANKMASK(PWM2DCH), 4
#define PWM2DCH5                         BANKMASK(PWM2DCH), 5
#define PWM2DCH6                         BANKMASK(PWM2DCH), 6
#define PWM2DCH7                         BANKMASK(PWM2DCH), 7
#define PWM2DCIE                         BANKMASK(PWM2INTE), 1
#define PWM2DCIF                         BANKMASK(PWM2INTF), 1
#define PWM2DCL0                         BANKMASK(PWM2DCL), 0
#define PWM2DCL1                         BANKMASK(PWM2DCL), 1
#define PWM2DCL2                         BANKMASK(PWM2DCL), 2
#define PWM2DCL3                         BANKMASK(PWM2DCL), 3
#define PWM2DCL4                         BANKMASK(PWM2DCL), 4
#define PWM2DCL5                         BANKMASK(PWM2DCL), 5
#define PWM2DCL6                         BANKMASK(PWM2DCL), 6
#define PWM2DCL7                         BANKMASK(PWM2DCL), 7
#define PWM2EN                           BANKMASK(PWM2CON), 7
#define PWM2EN_A                         BANKMASK(PWMEN), 1
#define PWM2IE                           BANKMASK(PIE3), 5
#define PWM2IF                           BANKMASK(PIR3), 5
#define PWM2LD                           BANKMASK(PWM2LDCON), 7
#define PWM2LDA_A                        BANKMASK(PWMLD), 1
#define PWM2LDM                          BANKMASK(PWM2LDCON), 6
#define PWM2LDS0                         BANKMASK(PWM2LDCON), 0
#define PWM2LDS1                         BANKMASK(PWM2LDCON), 1
#define PWM2MODE0                        BANKMASK(PWM2CON), 2
#define PWM2MODE1                        BANKMASK(PWM2CON), 3
#define PWM2OE                           BANKMASK(PWM2CON), 6
#define PWM2OFH0                         BANKMASK(PWM2OFH), 0
#define PWM2OFH1                         BANKMASK(PWM2OFH), 1
#define PWM2OFH2                         BANKMASK(PWM2OFH), 2
#define PWM2OFH3                         BANKMASK(PWM2OFH), 3
#define PWM2OFH4                         BANKMASK(PWM2OFH), 4
#define PWM2OFH5                         BANKMASK(PWM2OFH), 5
#define PWM2OFH6                         BANKMASK(PWM2OFH), 6
#define PWM2OFH7                         BANKMASK(PWM2OFH), 7
#define PWM2OFIE                         BANKMASK(PWM2INTE), 3
#define PWM2OFIF                         BANKMASK(PWM2INTF), 3
#define PWM2OFL0                         BANKMASK(PWM2OFL), 0
#define PWM2OFL1                         BANKMASK(PWM2OFL), 1
#define PWM2OFL2                         BANKMASK(PWM2OFL), 2
#define PWM2OFL3                         BANKMASK(PWM2OFL), 3
#define PWM2OFL4                         BANKMASK(PWM2OFL), 4
#define PWM2OFL5                         BANKMASK(PWM2OFL), 5
#define PWM2OFL6                         BANKMASK(PWM2OFL), 6
#define PWM2OFL7                         BANKMASK(PWM2OFL), 7
#define PWM2OFM0                         BANKMASK(PWM2OFCON), 5
#define PWM2OFM1                         BANKMASK(PWM2OFCON), 6
#define PWM2OFMC                         BANKMASK(PWM2OFCON), 4
#define PWM2OFS0                         BANKMASK(PWM2OFCON), 0
#define PWM2OFS1                         BANKMASK(PWM2OFCON), 1
#define PWM2OUT                          BANKMASK(PWM2CON), 5
#define PWM2OUT_A                        BANKMASK(PWMOUT), 1
#define PWM2PHH0                         BANKMASK(PWM2PHH), 0
#define PWM2PHH1                         BANKMASK(PWM2PHH), 1
#define PWM2PHH2                         BANKMASK(PWM2PHH), 2
#define PWM2PHH3                         BANKMASK(PWM2PHH), 3
#define PWM2PHH4                         BANKMASK(PWM2PHH), 4
#define PWM2PHH5                         BANKMASK(PWM2PHH), 5
#define PWM2PHH6                         BANKMASK(PWM2PHH), 6
#define PWM2PHH7                         BANKMASK(PWM2PHH), 7
#define PWM2PHIE                         BANKMASK(PWM2INTE), 2
#define PWM2PHIF                         BANKMASK(PWM2INTF), 2
#define PWM2PHL0                         BANKMASK(PWM2PHL), 0
#define PWM2PHL1                         BANKMASK(PWM2PHL), 1
#define PWM2PHL2                         BANKMASK(PWM2PHL), 2
#define PWM2PHL3                         BANKMASK(PWM2PHL), 3
#define PWM2PHL4                         BANKMASK(PWM2PHL), 4
#define PWM2PHL5                         BANKMASK(PWM2PHL), 5
#define PWM2PHL6                         BANKMASK(PWM2PHL), 6
#define PWM2PHL7                         BANKMASK(PWM2PHL), 7
#define PWM2POL                          BANKMASK(PWM2CON), 4
#define PWM2PRH0                         BANKMASK(PWM2PRH), 0
#define PWM2PRH1                         BANKMASK(PWM2PRH), 1
#define PWM2PRH2                         BANKMASK(PWM2PRH), 2
#define PWM2PRH3                         BANKMASK(PWM2PRH), 3
#define PWM2PRH4                         BANKMASK(PWM2PRH), 4
#define PWM2PRH5                         BANKMASK(PWM2PRH), 5
#define PWM2PRH6                         BANKMASK(PWM2PRH), 6
#define PWM2PRH7                         BANKMASK(PWM2PRH), 7
#define PWM2PRIE                         BANKMASK(PWM2INTE), 0
#define PWM2PRIF                         BANKMASK(PWM2INTF), 0
#define PWM2PRL0                         BANKMASK(PWM2PRL), 0
#define PWM2PRL1                         BANKMASK(PWM2PRL), 1
#define PWM2PRL2                         BANKMASK(PWM2PRL), 2
#define PWM2PRL3                         BANKMASK(PWM2PRL), 3
#define PWM2PRL4                         BANKMASK(PWM2PRL), 4
#define PWM2PRL5                         BANKMASK(PWM2PRL), 5
#define PWM2PRL6                         BANKMASK(PWM2PRL), 6
#define PWM2PRL7                         BANKMASK(PWM2PRL), 7
#define PWM2PS0                          BANKMASK(PWM2CLKCON), 4
#define PWM2PS1                          BANKMASK(PWM2CLKCON), 5
#define PWM2PS2                          BANKMASK(PWM2CLKCON), 6
#define PWM2TMRH0                        BANKMASK(PWM2TMRH), 0
#define PWM2TMRH1                        BANKMASK(PWM2TMRH), 1
#define PWM2TMRH2                        BANKMASK(PWM2TMRH), 2
#define PWM2TMRH3                        BANKMASK(PWM2TMRH), 3
#define PWM2TMRH4                        BANKMASK(PWM2TMRH), 4
#define PWM2TMRH5                        BANKMASK(PWM2TMRH), 5
#define PWM2TMRH6                        BANKMASK(PWM2TMRH), 6
#define PWM2TMRH7                        BANKMASK(PWM2TMRH), 7
#define PWM2TMRL0                        BANKMASK(PWM2TMRL), 0
#define PWM2TMRL1                        BANKMASK(PWM2TMRL), 1
#define PWM2TMRL2                        BANKMASK(PWM2TMRL), 2
#define PWM2TMRL3                        BANKMASK(PWM2TMRL), 3
#define PWM2TMRL4                        BANKMASK(PWM2TMRL), 4
#define PWM2TMRL5                        BANKMASK(PWM2TMRL), 5
#define PWM2TMRL6                        BANKMASK(PWM2TMRL), 6
#define PWM2TMRL7                        BANKMASK(PWM2TMRL), 7
#define PWM3CS0                          BANKMASK(PWM3CLKCON), 0
#define PWM3CS1                          BANKMASK(PWM3CLKCON), 1
#define PWM3DCH0                         BANKMASK(PWM3DCH), 0
#define PWM3DCH1                         BANKMASK(PWM3DCH), 1
#define PWM3DCH2                         BANKMASK(PWM3DCH), 2
#define PWM3DCH3                         BANKMASK(PWM3DCH), 3
#define PWM3DCH4                         BANKMASK(PWM3DCH), 4
#define PWM3DCH5                         BANKMASK(PWM3DCH), 5
#define PWM3DCH6                         BANKMASK(PWM3DCH), 6
#define PWM3DCH7                         BANKMASK(PWM3DCH), 7
#define PWM3DCIE                         BANKMASK(PWM3INTE), 1
#define PWM3DCIF                         BANKMASK(PWM3INTF), 1
#define PWM3DCL0                         BANKMASK(PWM3DCL), 0
#define PWM3DCL1                         BANKMASK(PWM3DCL), 1
#define PWM3DCL2                         BANKMASK(PWM3DCL), 2
#define PWM3DCL3                         BANKMASK(PWM3DCL), 3
#define PWM3DCL4                         BANKMASK(PWM3DCL), 4
#define PWM3DCL5                         BANKMASK(PWM3DCL), 5
#define PWM3DCL6                         BANKMASK(PWM3DCL), 6
#define PWM3DCL7                         BANKMASK(PWM3DCL), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3EN_A                         BANKMASK(PWMEN), 2
#define PWM3IE                           BANKMASK(PIE3), 6
#define PWM3IF                           BANKMASK(PIR3), 6
#define PWM3LD                           BANKMASK(PWM3LDCON), 7
#define PWM3LDA_A                        BANKMASK(PWMLD), 2
#define PWM3LDM                          BANKMASK(PWM3LDCON), 6
#define PWM3LDS0                         BANKMASK(PWM3LDCON), 0
#define PWM3LDS1                         BANKMASK(PWM3LDCON), 1
#define PWM3MODE0                        BANKMASK(PWM3CON), 2
#define PWM3MODE1                        BANKMASK(PWM3CON), 3
#define PWM3OE                           BANKMASK(PWM3CON), 6
#define PWM3OFH0                         BANKMASK(PWM3OFH), 0
#define PWM3OFH1                         BANKMASK(PWM3OFH), 1
#define PWM3OFH2                         BANKMASK(PWM3OFH), 2
#define PWM3OFH3                         BANKMASK(PWM3OFH), 3
#define PWM3OFH4                         BANKMASK(PWM3OFH), 4
#define PWM3OFH5                         BANKMASK(PWM3OFH), 5
#define PWM3OFH6                         BANKMASK(PWM3OFH), 6
#define PWM3OFH7                         BANKMASK(PWM3OFH), 7
#define PWM3OFIE                         BANKMASK(PWM3INTE), 3
#define PWM3OFIF                         BANKMASK(PWM3INTF), 3
#define PWM3OFL0                         BANKMASK(PWM3OFL), 0
#define PWM3OFL1                         BANKMASK(PWM3OFL), 1
#define PWM3OFL2                         BANKMASK(PWM3OFL), 2
#define PWM3OFL3                         BANKMASK(PWM3OFL), 3
#define PWM3OFL4                         BANKMASK(PWM3OFL), 4
#define PWM3OFL5                         BANKMASK(PWM3OFL), 5
#define PWM3OFL6                         BANKMASK(PWM3OFL), 6
#define PWM3OFL7                         BANKMASK(PWM3OFL), 7
#define PWM3OFM0                         BANKMASK(PWM3OFCON), 5
#define PWM3OFM1                         BANKMASK(PWM3OFCON), 6
#define PWM3OFMC                         BANKMASK(PWM3OFCON), 4
#define PWM3OFS0                         BANKMASK(PWM3OFCON), 0
#define PWM3OFS1                         BANKMASK(PWM3OFCON), 1
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3OUT_A                        BANKMASK(PWMOUT), 2
#define PWM3PHH0                         BANKMASK(PWM3PHH), 0
#define PWM3PHH1                         BANKMASK(PWM3PHH), 1
#define PWM3PHH2                         BANKMASK(PWM3PHH), 2
#define PWM3PHH3                         BANKMASK(PWM3PHH), 3
#define PWM3PHH4                         BANKMASK(PWM3PHH), 4
#define PWM3PHH5                         BANKMASK(PWM3PHH), 5
#define PWM3PHH6                         BANKMASK(PWM3PHH), 6
#define PWM3PHH7                         BANKMASK(PWM3PHH), 7
#define PWM3PHIE                         BANKMASK(PWM3INTE), 2
#define PWM3PHIF                         BANKMASK(PWM3INTF), 2
#define PWM3PHL0                         BANKMASK(PWM3PHL), 0
#define PWM3PHL1                         BANKMASK(PWM3PHL), 1
#define PWM3PHL2                         BANKMASK(PWM3PHL), 2
#define PWM3PHL3                         BANKMASK(PWM3PHL), 3
#define PWM3PHL4                         BANKMASK(PWM3PHL), 4
#define PWM3PHL5                         BANKMASK(PWM3PHL), 5
#define PWM3PHL6                         BANKMASK(PWM3PHL), 6
#define PWM3PHL7                         BANKMASK(PWM3PHL), 7
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM3PRH0                         BANKMASK(PWM3PRH), 0
#define PWM3PRH1                         BANKMASK(PWM3PRH), 1
#define PWM3PRH2                         BANKMASK(PWM3PRH), 2
#define PWM3PRH3                         BANKMASK(PWM3PRH), 3
#define PWM3PRH4                         BANKMASK(PWM3PRH), 4
#define PWM3PRH5                         BANKMASK(PWM3PRH), 5
#define PWM3PRH6                         BANKMASK(PWM3PRH), 6
#define PWM3PRH7                         BANKMASK(PWM3PRH), 7
#define PWM3PRIE                         BANKMASK(PWM3INTE), 0
#define PWM3PRIF                         BANKMASK(PWM3INTF), 0
#define PWM3PRL0                         BANKMASK(PWM3PRL), 0
#define PWM3PRL1                         BANKMASK(PWM3PRL), 1
#define PWM3PRL2                         BANKMASK(PWM3PRL), 2
#define PWM3PRL3                         BANKMASK(PWM3PRL), 3
#define PWM3PRL4                         BANKMASK(PWM3PRL), 4
#define PWM3PRL5                         BANKMASK(PWM3PRL), 5
#define PWM3PRL6                         BANKMASK(PWM3PRL), 6
#define PWM3PRL7                         BANKMASK(PWM3PRL), 7
#define PWM3PS0                          BANKMASK(PWM3CLKCON), 4
#define PWM3PS1                          BANKMASK(PWM3CLKCON), 5
#define PWM3PS2                          BANKMASK(PWM3CLKCON), 6
#define PWM3TMRH0                        BANKMASK(PWM3TMRH), 0
#define PWM3TMRH1                        BANKMASK(PWM3TMRH), 1
#define PWM3TMRH2                        BANKMASK(PWM3TMRH), 2
#define PWM3TMRH3                        BANKMASK(PWM3TMRH), 3
#define PWM3TMRH4                        BANKMASK(PWM3TMRH), 4
#define PWM3TMRH5                        BANKMASK(PWM3TMRH), 5
#define PWM3TMRH6                        BANKMASK(PWM3TMRH), 6
#define PWM3TMRH7                        BANKMASK(PWM3TMRH), 7
#define PWM3TMRL0                        BANKMASK(PWM3TMRL), 0
#define PWM3TMRL1                        BANKMASK(PWM3TMRL), 1
#define PWM3TMRL2                        BANKMASK(PWM3TMRL), 2
#define PWM3TMRL3                        BANKMASK(PWM3TMRL), 3
#define PWM3TMRL4                        BANKMASK(PWM3TMRL), 4
#define PWM3TMRL5                        BANKMASK(PWM3TMRL), 5
#define PWM3TMRL6                        BANKMASK(PWM3TMRL), 6
#define PWM3TMRL7                        BANKMASK(PWM3TMRL), 7
#define PWM4CS0                          BANKMASK(PWM4CLKCON), 0
#define PWM4CS1                          BANKMASK(PWM4CLKCON), 1
#define PWM4DCH0                         BANKMASK(PWM4DCH), 0
#define PWM4DCH1                         BANKMASK(PWM4DCH), 1
#define PWM4DCH2                         BANKMASK(PWM4DCH), 2
#define PWM4DCH3                         BANKMASK(PWM4DCH), 3
#define PWM4DCH4                         BANKMASK(PWM4DCH), 4
#define PWM4DCH5                         BANKMASK(PWM4DCH), 5
#define PWM4DCH6                         BANKMASK(PWM4DCH), 6
#define PWM4DCH7                         BANKMASK(PWM4DCH), 7
#define PWM4DCIE                         BANKMASK(PWM4INTE), 1
#define PWM4DCIF                         BANKMASK(PWM4INTF), 1
#define PWM4DCL0                         BANKMASK(PWM4DCL), 0
#define PWM4DCL1                         BANKMASK(PWM4DCL), 1
#define PWM4DCL2                         BANKMASK(PWM4DCL), 2
#define PWM4DCL3                         BANKMASK(PWM4DCL), 3
#define PWM4DCL4                         BANKMASK(PWM4DCL), 4
#define PWM4DCL5                         BANKMASK(PWM4DCL), 5
#define PWM4DCL6                         BANKMASK(PWM4DCL), 6
#define PWM4DCL7                         BANKMASK(PWM4DCL), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4EN_A                         BANKMASK(PWMEN), 3
#define PWM4IE                           BANKMASK(PIE3), 7
#define PWM4IF                           BANKMASK(PIR3), 7
#define PWM4LD                           BANKMASK(PWM4LDCON), 7
#define PWM4LDA_A                        BANKMASK(PWMLD), 3
#define PWM4LDM                          BANKMASK(PWM4LDCON), 6
#define PWM4LDS0                         BANKMASK(PWM4LDCON), 0
#define PWM4LDS1                         BANKMASK(PWM4LDCON), 1
#define PWM4MODE0                        BANKMASK(PWM4CON), 2
#define PWM4MODE1                        BANKMASK(PWM4CON), 3
#define PWM4OE                           BANKMASK(PWM4CON), 6
#define PWM4OFH0                         BANKMASK(PWM4OFH), 0
#define PWM4OFH1                         BANKMASK(PWM4OFH), 1
#define PWM4OFH2                         BANKMASK(PWM4OFH), 2
#define PWM4OFH3                         BANKMASK(PWM4OFH), 3
#define PWM4OFH4                         BANKMASK(PWM4OFH), 4
#define PWM4OFH5                         BANKMASK(PWM4OFH), 5
#define PWM4OFH6                         BANKMASK(PWM4OFH), 6
#define PWM4OFH7                         BANKMASK(PWM4OFH), 7
#define PWM4OFIE                         BANKMASK(PWM4INTE), 3
#define PWM4OFIF                         BANKMASK(PWM4INTF), 3
#define PWM4OFL0                         BANKMASK(PWM4OFL), 0
#define PWM4OFL1                         BANKMASK(PWM4OFL), 1
#define PWM4OFL2                         BANKMASK(PWM4OFL), 2
#define PWM4OFL3                         BANKMASK(PWM4OFL), 3
#define PWM4OFL4                         BANKMASK(PWM4OFL), 4
#define PWM4OFL5                         BANKMASK(PWM4OFL), 5
#define PWM4OFL6                         BANKMASK(PWM4OFL), 6
#define PWM4OFL7                         BANKMASK(PWM4OFL), 7
#define PWM4OFM0                         BANKMASK(PWM4OFCON), 5
#define PWM4OFM1                         BANKMASK(PWM4OFCON), 6
#define PWM4OFMC                         BANKMASK(PWM4OFCON), 4
#define PWM4OFS0                         BANKMASK(PWM4OFCON), 0
#define PWM4OFS1                         BANKMASK(PWM4OFCON), 1
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4OUT_A                        BANKMASK(PWMOUT), 3
#define PWM4PHH0                         BANKMASK(PWM4PHH), 0
#define PWM4PHH1                         BANKMASK(PWM4PHH), 1
#define PWM4PHH2                         BANKMASK(PWM4PHH), 2
#define PWM4PHH3                         BANKMASK(PWM4PHH), 3
#define PWM4PHH4                         BANKMASK(PWM4PHH), 4
#define PWM4PHH5                         BANKMASK(PWM4PHH), 5
#define PWM4PHH6                         BANKMASK(PWM4PHH), 6
#define PWM4PHH7                         BANKMASK(PWM4PHH), 7
#define PWM4PHIE                         BANKMASK(PWM4INTE), 2
#define PWM4PHIF                         BANKMASK(PWM4INTF), 2
#define PWM4PHL0                         BANKMASK(PWM4PHL), 0
#define PWM4PHL1                         BANKMASK(PWM4PHL), 1
#define PWM4PHL2                         BANKMASK(PWM4PHL), 2
#define PWM4PHL3                         BANKMASK(PWM4PHL), 3
#define PWM4PHL4                         BANKMASK(PWM4PHL), 4
#define PWM4PHL5                         BANKMASK(PWM4PHL), 5
#define PWM4PHL6                         BANKMASK(PWM4PHL), 6
#define PWM4PHL7                         BANKMASK(PWM4PHL), 7
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define PWM4PRH0                         BANKMASK(PWM4PRH), 0
#define PWM4PRH1                         BANKMASK(PWM4PRH), 1
#define PWM4PRH2                         BANKMASK(PWM4PRH), 2
#define PWM4PRH3                         BANKMASK(PWM4PRH), 3
#define PWM4PRH4                         BANKMASK(PWM4PRH), 4
#define PWM4PRH5                         BANKMASK(PWM4PRH), 5
#define PWM4PRH6                         BANKMASK(PWM4PRH), 6
#define PWM4PRH7                         BANKMASK(PWM4PRH), 7
#define PWM4PRIE                         BANKMASK(PWM4INTE), 0
#define PWM4PRIF                         BANKMASK(PWM4INTF), 0
#define PWM4PRL0                         BANKMASK(PWM4PRL), 0
#define PWM4PRL1                         BANKMASK(PWM4PRL), 1
#define PWM4PRL2                         BANKMASK(PWM4PRL), 2
#define PWM4PRL3                         BANKMASK(PWM4PRL), 3
#define PWM4PRL4                         BANKMASK(PWM4PRL), 4
#define PWM4PRL5                         BANKMASK(PWM4PRL), 5
#define PWM4PRL6                         BANKMASK(PWM4PRL), 6
#define PWM4PRL7                         BANKMASK(PWM4PRL), 7
#define PWM4PS0                          BANKMASK(PWM4CLKCON), 4
#define PWM4PS1                          BANKMASK(PWM4CLKCON), 5
#define PWM4PS2                          BANKMASK(PWM4CLKCON), 6
#define PWM4TMRH0                        BANKMASK(PWM4TMRH), 0
#define PWM4TMRH1                        BANKMASK(PWM4TMRH), 1
#define PWM4TMRH2                        BANKMASK(PWM4TMRH), 2
#define PWM4TMRH3                        BANKMASK(PWM4TMRH), 3
#define PWM4TMRH4                        BANKMASK(PWM4TMRH), 4
#define PWM4TMRH5                        BANKMASK(PWM4TMRH), 5
#define PWM4TMRH6                        BANKMASK(PWM4TMRH), 6
#define PWM4TMRH7                        BANKMASK(PWM4TMRH), 7
#define PWM4TMRL0                        BANKMASK(PWM4TMRL), 0
#define PWM4TMRL1                        BANKMASK(PWM4TMRL), 1
#define PWM4TMRL2                        BANKMASK(PWM4TMRL), 2
#define PWM4TMRL3                        BANKMASK(PWM4TMRL), 3
#define PWM4TMRL4                        BANKMASK(PWM4TMRL), 4
#define PWM4TMRL5                        BANKMASK(PWM4TMRL), 5
#define PWM4TMRL6                        BANKMASK(PWM4TMRL), 6
#define PWM4TMRL7                        BANKMASK(PWM4TMRL), 7
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
